GopalSaraf/Practicals/PSDL/include/proc/pic18f25k50.inc
// Register: SPBRGH1
#define SPBRGH1 SPBRGH1
SPBRGH1                                  equ 0FB0h
// bitfield definitions
SPBRGH1_SPBRGH1_POSN                     equ 0000h
SPBRGH1_SPBRGH1_POSITION                 equ 0000h
SPBRGH1_SPBRGH1_SIZE                     equ 0008h
SPBRGH1_SPBRGH1_LENGTH                   equ 0008h
SPBRGH1_SPBRGH1_MASK                     equ 00FFh
SPBRGH1_BRG8_POSN                        equ 0000h
SPBRGH1_BRG8_POSITION                    equ 0000h
SPBRGH1_BRG8_SIZE                        equ 0001h
SPBRGH1_BRG8_LENGTH                      equ 0001h
SPBRGH1_BRG8_MASK                        equ 0001h
SPBRGH1_BRG9_POSN                        equ 0001h
SPBRGH1_BRG9_POSITION                    equ 0001h
SPBRGH1_BRG9_SIZE                        equ 0001h
SPBRGH1_BRG9_LENGTH                      equ 0001h
SPBRGH1_BRG9_MASK                        equ 0002h
SPBRGH1_BRG10_POSN                       equ 0002h
SPBRGH1_BRG10_POSITION                   equ 0002h
SPBRGH1_BRG10_SIZE                       equ 0001h
SPBRGH1_BRG10_LENGTH                     equ 0001h
SPBRGH1_BRG10_MASK                       equ 0004h
SPBRGH1_BRG11_POSN                       equ 0003h
SPBRGH1_BRG11_POSITION                   equ 0003h
SPBRGH1_BRG11_SIZE                       equ 0001h
SPBRGH1_BRG11_LENGTH                     equ 0001h
SPBRGH1_BRG11_MASK                       equ 0008h
SPBRGH1_BRG12_POSN                       equ 0004h
SPBRGH1_BRG12_POSITION                   equ 0004h
SPBRGH1_BRG12_SIZE                       equ 0001h
SPBRGH1_BRG12_LENGTH                     equ 0001h
SPBRGH1_BRG12_MASK                       equ 0010h
SPBRGH1_BRG13_POSN                       equ 0005h
SPBRGH1_BRG13_POSITION                   equ 0005h
SPBRGH1_BRG13_SIZE                       equ 0001h
SPBRGH1_BRG13_LENGTH                     equ 0001h
SPBRGH1_BRG13_MASK                       equ 0020h
SPBRGH1_BRG14_POSN                       equ 0006h
SPBRGH1_BRG14_POSITION                   equ 0006h
SPBRGH1_BRG14_SIZE                       equ 0001h
SPBRGH1_BRG14_LENGTH                     equ 0001h
SPBRGH1_BRG14_MASK                       equ 0040h
SPBRGH1_BRG15_POSN                       equ 0007h
SPBRGH1_BRG15_POSITION                   equ 0007h
SPBRGH1_BRG15_SIZE                       equ 0001h
SPBRGH1_BRG15_LENGTH                     equ 0001h
SPBRGH1_BRG15_MASK                       equ 0080h

// Register: T3CON
#define T3CON T3CON
T3CON                                    equ 0FB1h
// bitfield definitions
T3CON_NOT_T3SYNC_POSN                    equ 0002h
T3CON_NOT_T3SYNC_POSITION                equ 0002h
T3CON_NOT_T3SYNC_SIZE                    equ 0001h
T3CON_NOT_T3SYNC_LENGTH                  equ 0001h
T3CON_NOT_T3SYNC_MASK                    equ 0004h
T3CON_TMR3ON_POSN                        equ 0000h
T3CON_TMR3ON_POSITION                    equ 0000h
T3CON_TMR3ON_SIZE                        equ 0001h
T3CON_TMR3ON_LENGTH                      equ 0001h
T3CON_TMR3ON_MASK                        equ 0001h
T3CON_RD16_POSN                          equ 0001h
T3CON_RD16_POSITION                      equ 0001h
T3CON_RD16_SIZE                          equ 0001h
T3CON_RD16_LENGTH                        equ 0001h
T3CON_RD16_MASK                          equ 0002h
T3CON_nT3SYNC_POSN                       equ 0002h
T3CON_nT3SYNC_POSITION                   equ 0002h
T3CON_nT3SYNC_SIZE                       equ 0001h
T3CON_nT3SYNC_LENGTH                     equ 0001h
T3CON_nT3SYNC_MASK                       equ 0004h
T3CON_SOSCEN_POSN                        equ 0003h
T3CON_SOSCEN_POSITION                    equ 0003h
T3CON_SOSCEN_SIZE                        equ 0001h
T3CON_SOSCEN_LENGTH                      equ 0001h
T3CON_SOSCEN_MASK                        equ 0008h
T3CON_T3CKPS_POSN                        equ 0004h
T3CON_T3CKPS_POSITION                    equ 0004h
T3CON_T3CKPS_SIZE                        equ 0002h
T3CON_T3CKPS_LENGTH                      equ 0002h
T3CON_T3CKPS_MASK                        equ 0030h
T3CON_TMR3CS_POSN                        equ 0006h
T3CON_TMR3CS_POSITION                    equ 0006h
T3CON_TMR3CS_SIZE                        equ 0002h
T3CON_TMR3CS_LENGTH                      equ 0002h
T3CON_TMR3CS_MASK                        equ 00C0h
T3CON_T3RD16_POSN                        equ 0001h
T3CON_T3RD16_POSITION                    equ 0001h
T3CON_T3RD16_SIZE                        equ 0001h
T3CON_T3RD16_LENGTH                      equ 0001h
T3CON_T3RD16_MASK                        equ 0002h
T3CON_T3SYNC_POSN                        equ 0002h
T3CON_T3SYNC_POSITION                    equ 0002h
T3CON_T3SYNC_SIZE                        equ 0001h
T3CON_T3SYNC_LENGTH                      equ 0001h
T3CON_T3SYNC_MASK                        equ 0004h
T3CON_T3SOSCEN_POSN                      equ 0003h
T3CON_T3SOSCEN_POSITION                  equ 0003h
T3CON_T3SOSCEN_SIZE                      equ 0001h
T3CON_T3SOSCEN_LENGTH                    equ 0001h
T3CON_T3SOSCEN_MASK                      equ 0008h
T3CON_T3CKPS0_POSN                       equ 0004h
T3CON_T3CKPS0_POSITION                   equ 0004h
T3CON_T3CKPS0_SIZE                       equ 0001h
T3CON_T3CKPS0_LENGTH                     equ 0001h
T3CON_T3CKPS0_MASK                       equ 0010h
T3CON_T3CKPS1_POSN                       equ 0005h
T3CON_T3CKPS1_POSITION                   equ 0005h
T3CON_T3CKPS1_SIZE                       equ 0001h
T3CON_T3CKPS1_LENGTH                     equ 0001h
T3CON_T3CKPS1_MASK                       equ 0020h
T3CON_TMR3CS0_POSN                       equ 0006h
T3CON_TMR3CS0_POSITION                   equ 0006h
T3CON_TMR3CS0_SIZE                       equ 0001h
T3CON_TMR3CS0_LENGTH                     equ 0001h
T3CON_TMR3CS0_MASK                       equ 0040h
T3CON_TMR3CS1_POSN                       equ 0007h
T3CON_TMR3CS1_POSITION                   equ 0007h
T3CON_TMR3CS1_SIZE                       equ 0001h
T3CON_TMR3CS1_LENGTH                     equ 0001h
T3CON_TMR3CS1_MASK                       equ 0080h
T3CON_T3OSCEN_POSN                       equ 0003h
T3CON_T3OSCEN_POSITION                   equ 0003h
T3CON_T3OSCEN_SIZE                       equ 0001h
T3CON_T3OSCEN_LENGTH                     equ 0001h
T3CON_T3OSCEN_MASK                       equ 0008h
T3CON_SOSCEN3_POSN                       equ 0003h
T3CON_SOSCEN3_POSITION                   equ 0003h
T3CON_SOSCEN3_SIZE                       equ 0001h
T3CON_SOSCEN3_LENGTH                     equ 0001h
T3CON_SOSCEN3_MASK                       equ 0008h
T3CON_RD163_POSN                         equ 0007h
T3CON_RD163_POSITION                     equ 0007h
T3CON_RD163_SIZE                         equ 0001h
T3CON_RD163_LENGTH                       equ 0001h
T3CON_RD163_MASK                         equ 0080h

// Register: TMR3
#define TMR3 TMR3
TMR3                                     equ 0FB2h

// Register: TMR3L
#define TMR3L TMR3L
TMR3L                                    equ 0FB2h
// bitfield definitions
TMR3L_TMR3L_POSN                         equ 0000h
TMR3L_TMR3L_POSITION                     equ 0000h
TMR3L_TMR3L_SIZE                         equ 0008h
TMR3L_TMR3L_LENGTH                       equ 0008h
TMR3L_TMR3L_MASK                         equ 00FFh

